[{"id": 0, "Job": "Junior Web Developer", "Job_link": "https://lk.linkedin.com/jobs/view/junior-web-developer-at-liss-solutions-3781897909?position=1&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=FQWLG18BjWb6dVacTq9oqA%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Liss Solutions", "Company_link": "https://al.linkedin.com/company/liss-solutions?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Are you passionate about web development and eager to kickstart your career in a dynamic and remote-friendly environment? Look no further than Liss Solutions, where we're on the lookout for a talented Junior Web Developer to join our team. If you have a knack for coding, a hunger for learning, and a desire to make your mark in the world of web development, we want to hear from you!The RoleYou Will Be Responsible ForWriting well-designed, testable and efficient code.Gathering and evaluating user feedback.Working as a part of a dynamic team to deliver winning products.Providing code documentation and other inputs to technical documents.Supporting continuous improvement by investigating alternatives and new technologies and presenting these for architectural review.Troubleshooting and debugging to optimise performance.Ideal ProfileYou possess a Degree/Diploma in Computer Science, Engineering or related field.You have at least 1 year experience, ideally within a Software Engineer role.You possess strong knowledge of HTML, HTML5 / CSS, Javascript and WordPress.You are adaptable and thrive in changing environmentsYou are a self-starter and demonstrate a high level of resilienceYou are a strong networker & relationship builderWhat's on Offer?Leadership RoleOpportunity within company with a solid track record of successWork alongside & learn from best in class talent\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQEQRCqNFr2NyA/company-logo_100_100/0/1678616414535?e=2147483647&v=beta&t=eGj8T7GhOx39C3IK5vNUzi10YXW_vJb5Vq_6-J1yb-A"}, {"id": 1, "Job": "Junior Software Engineer", "Job_link": "https://lk.linkedin.com/jobs/view/junior-software-engineer-at-george-bernard-3808428530?position=2&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=nG2tt%2BMQe3YRs5WdIcrvLQ%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "George Bernard", "Company_link": "https://lk.linkedin.com/company/georgebernardconsulting?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Writing, modifying, and debugging code using programming languages and development tools Participating in testing activities, including unit testing, integration testing, and debugging code to identify and fix issues  Design, construct and maintain client-facing and internal tools that are easy to use  Documenting code, technical specifications, and procedures to ensure maintainability and transfer knowledge within the team Collaborate with internal teams to create wireframes, prototypes, and mockups for existing product enhancements, as well as new features and products  Collaborate with internal teams to constantly develop, monitor and optimize the products  Using version control systems like Git to manage code changes, track revisions, and collaborate effectively within the development team Work with internal teams to explore and create new design/architectures for better scaling and performance of back-end services  Conduct and participate in code and design reviews to achieve and maintain high development standards Actively participating in team meetings, training sessions, and workshops to stay updated RequirementsA bachelors degree in Computer Science, Software Engineering, Computer Engineering, or a related field  Role is open to fresh graduates  Passionate about innovating, learning new skills and technology  In-depth understanding of computer science fundamentals (data structures and algorithms, operating systems, networks, databases, etc)  Strong and hands-on experience with one or more of the following tech stacks: React, Node.js, Go, Python, C++, Java  Familiarity with development tools, integrated development environments (IDEs), and version control systems Experience with relational databases like MySQL is a plus  Comfortable working on frontend and backend tasks  Attention to detail in writing code, identifying issues, and adhering to coding standards Strong interpersonal skills and the ability to work effectively in a team environment\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQERZLqS1voOkg/company-logo_100_100/0/1631346338073?e=2147483647&v=beta&t=ZAjYNYkA-X6MwKn2FaJJTdikIRTTGcTRUTpE66Ul0-g"}, {"id": 2, "Job": "Software Engineer - Java", "Job_link": "https://lk.linkedin.com/jobs/view/software-engineer-java-at-millenniumit-esp-3802298277?position=3&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=mlGbi1O9o8KFrfIs5Xsy3A%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "MillenniumIT ESP", "Company_link": "https://lk.linkedin.com/company/millennium-it-esp?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Job DescriptionDevelop high-quality software design and architectureIdentify, prioritize and execute tasks in the software development life cycleDevelop tools and applications by producing clean, efficient codeAutomate tasks through appropriate tools and scriptingReview and debug codePerform validation and verification testingCollaborate with internal teams and vendors to fix and improve productsDocument development phases and monitor systemsEnsure software is up-to-date with latest technologiesPerson SpecificationProven experience as a Software EngineerBSc in Computer Science is preferredExtensive experience in software development, scripting and project managementKnowledge of selected programming languages - JavaIn-depth knowledge of relational databases (e.g. PostgreSQL, MySQL) and NoSQL databases (e.g. MongoDB)Analytical mind with problem-solving aptitudeAbility to work independentlyExcellent organizational and leadership skills\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C510BAQEzJqsIxxkSHg/company-logo_100_100/0/1630613376465?e=2147483647&v=beta&t=fheIiCIniUcDuJDIvtQPVEz7yBF2oZ-GQMvUP2Z95yI"}, {"id": 3, "Job": "Software Engineer", "Job_link": "https://lk.linkedin.com/jobs/view/software-engineer-at-codegen-international-3806662883?position=4&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=ivVu3Z9mT54uQni8bTTVqQ%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "CodeGen International", "Company_link": "https://uk.linkedin.com/company/codegen?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "ResponsibilitiesAble to design software solutions and the feature rightCorrect use of technology and the best practices associated with themCreative mind to understand full picture and deliver resultsPassion to codeShould have a high level of initiative and follow-throughPre - RequisitesBSc in Computer Science or equivalent from a recognized universityMinimum One-year Industry ExperienceAbility to work in a team with good leadership qualitiesKnowledge in requirement analysis & solution designing adhering to the best practices in Software EngineeringFundamental knowledge in object-oriented concepts, databases and SOAFamiliarity with HTML5, CSS3, JavaScript and Angular2+Hands on experience in producing high quality, clear and maintainable codeKnowledge in design patternsKnowledge in Linux/Unix, Tomcat and OracleExperience in spring framework, microservices and high-performance computing will be a plus\n      \n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQF-OLXZfd4jcA/company-logo_100_100/0/1630546328600/codegen_logo?e=2147483647&v=beta&t=Z_wQkvVt5GPUctgUFi64qtz0jHMhhqqpMsByVPw037M"}, {"id": 4, "Job": "Software Engineer", "Job_link": "https://lk.linkedin.com/jobs/view/software-engineer-at-hackerpulse-3745304869?position=5&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=DX8hV4d7D%2FbWyF41X9riqg%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "HackerPulse", "Company_link": "https://www.linkedin.com/company/hackerpulse?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "HackerPulse is an innovative platform dedicated to empowering software engineers to confidently showcase their skills, validated through adaptive testing and data analysis. We leverage the power of machine learning to analyze data from a range of sources, including GitHub, StackOverflow, Hacker News, LinkedIn, and academic papers, to create comprehensive user profiles that reflect their true abilities.The RoleYou Will Be Responsible ForGathering and evaluating user feedback.Providing code documentation and other inputs to technical documents.Supporting continuous improvement by investigating alternatives and new technologies and presenting these for architectural review.Troubleshooting and debugging to optimise performance.Ideal ProfileYou possess a Degree/Diploma in Computer Science, Engineering or related field.You have at least 1 year experience, ideally within a Software Engineer role.You are highly goal driven and work well in fast paced environmentsYou possess strong analytical skills and are comfortable dealing with numerical dataYou pay strong attention to detail and deliver work that is of a high standardWhat's on Offer?Excellent career development opportunitiesLeadership RoleOpportunity to make a positive impact\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/D4D0BAQF2r19GINhGQw/company-logo_100_100/0/1680543780798?e=2147483647&v=beta&t=N-jeDbBNs9YBjo5ddFoDKJdZR_5hz4e_1cKOTUfSbh4"}, {"id": 5, "Job": "Front End Developer", "Job_link": "https://lk.linkedin.com/jobs/view/front-end-developer-at-strattmont-3802372995?position=6&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=XgJ%2B3EJMkVqasxaSWRP%2FYg%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Strattmont", "Company_link": "https://mk.linkedin.com/company/strattmont?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "We are seeking a skilled Front-End Developer with 1-3 years of experience, specializing in coding engaging landing pages. The ideal candidate should possess expertise in front-end technologies, including HTML, CSS, and React, and have experience translating designs from Figma/XD to WordPress. As a key member of our team, you will primarily focus on coding visually stunning and high-performance landing pages, collaborating closely with UX/UI designers to bring concepts to life.ResponsibilitiesDevelop and maintain visually appealing landing pages using HTML, CSS, and React. Collaborate with UX/UI designers to transform Figma/XD design mockups into interactive and responsive landing pages. Ensure the seamless integration of landing pages with WordPress, translating design concepts into functional and optimized web elements. Implement and adhere to coding best practices and standards to ensure consistency and scalability across landing pages. Work closely with cross-functional teams, including back-end developers, to optimize landing page performance and user experience. Debug and troubleshoot issues related to landing page functionality and responsiveness. Stay abreast of industry trends and emerging technologies to enhance landing page development processes. QualificationsBachelor's degree in Computer Science, Information Technology, or related field. Proven experience as a Front-End Developer with 1-3 years of hands-on experience. Proficient in HTML, CSS, and JavaScript. Experience with React is required. Experience translating designs from Figma/XD to WordPress, with a focus on landing pages. Strong understanding of responsive design principles and cross-browser compatibility. Familiarity with version control systems (e.g., Git). Solid understanding of web performance optimization and best practices. Strong problem-solving skills and attention to detail. Excellent communication and collaboration skills. Ability to work effectively in a fast-paced, dynamic environment. Preferred QualificationsExperience with other front-end frameworks/libraries. Understanding of SEO principles and best practices.\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQGIwxbYU7l8RA/company-logo_100_100/0/1635354912863/strattmont_logo?e=2147483647&v=beta&t=q29t31-uwYX01oFPuTQvAEdNlEV31a5JRLGjGzGG76w"}, {"id": 6, "Job": "Software Engineer (Java)", "Job_link": "https://lk.linkedin.com/jobs/view/software-engineer-java-at-george-bernard-3808425888?position=7&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=Lf41oKwQfIMAjNJ5AOwDJg%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "George Bernard", "Company_link": "https://lk.linkedin.com/company/georgebernardconsulting?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Following established methodologies like Agile, Scrum, or other SDLC methodologies Develop flowcharts, layouts and documentation to identify requirements and solutions  Write well-designed, testable code  Produce specifications and determine operational feasibility  Integrate software components into a fully functional software system  Develop software verification plans and quality assurance procedures  Using version control systems to manage code changes and collaborating effectively within a team Identifying bottlenecks and areas for performance improvement within the software system. Document and maintain software functionality  Troubleshoot, debug and upgrade existing systems  Deploy programs and evaluate user feedback  Comply with project plans and industry standards  Ensure software is updated with latest features RequirementsBSc degree in Computer Science, Engineering or relevant field  Proven work experience as a Software Engineer or Software Developer  Experience and expertise in software development methodologies (Agile, Scrum, Waterfall), understanding of the software development lifecycle (SDLC) and version control systems Experience designing interactive applications  Experience mobile application development frameworks preferred Ability to develop software in Java, Ruby on Rails, C++ or other programming languages  Excellent knowledge of relational databases, SQL and ORM technologies (JPA2, Hibernate) Proficiency in web development technologies such as HTML, CSS, JavaScript, and familiarity with front-end frameworks (React, Angular, Vue.js) and back-end frameworks (Node.js, Django)  Experience developing web applications using at least one popular web framework (JSF, Wicket, GWT, Spring MVC)  Proficiency in testing methodologies, writing test cases, and debugging code to identify and fix software defects. Experience with test-driven development  Proficiency in software engineering tools  Ability to document requirements and specifications  Ability to think creatively and propose innovative solutions, contributing fresh ideas to problem-solving and software design processes\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQERZLqS1voOkg/company-logo_100_100/0/1631346338073?e=2147483647&v=beta&t=ZAjYNYkA-X6MwKn2FaJJTdikIRTTGcTRUTpE66Ul0-g"}, {"id": 7, "Job": "Software Developer (Unity/Unreal, C#/C++)", "Job_link": "https://lk.linkedin.com/jobs/view/software-developer-unity-unreal-c%23-c%2B%2B-at-sydpro-sri-lanka-3759053664?position=8&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=FdLNxHfIIk2%2ByW8EI6yRGg%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Sydpro - Sri Lanka", "Company_link": "https://lk.linkedin.com/company/sydprosl?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Sydpro Pvt Ltd is a full-service provider of technical recruitment solutions. We provide ICT/Technical, Networking, Data Analytics, Admin & Compliance and Accounting talent for our global client base across all levels of seniority. Our goal is to become Sri Lanka’s largest provider of local talent to the world, helping global companies with their staffing needs while giving Sri Lankan’s a global stage to showcase their talent!If you are considering to upscale your career and challenge yourself working for a global company, then here's your chance to grab this amazing job opportunity before it's too late! We are fully aware of what the market is like at the moment, but we like to think this would be a great opportunity to work in a fantastic working culture with a supportive team.We are more than happy in meeting career-oriented individuals to work with us here at Sydpro Pvt Ltd.Role;The successful applicant will be a part of our client's growing team of passionate artists and engineers. You'll work with and learn from industry leaders, where quality and innovation is at the heart of everything they produce. Australian leaders in custom built Immersive and Interactive software, the successful applicant will work alongside a talented team working with cutting edge technology in a diverse range of industry sectors.This application is for a Mid Level Software Developer with experience in Unity/Unreal. Previous applicants to Sydpro are encouraged to apply.Required Skills and Experience;Four years of industry experience is essential. High proficiency is required in Unity/Unreal and C#/C++. Additional skill levels such as PHP, mySQL, JSON, etc, should be made clear in your resume. Experience with real-time projects and mobile apps is essential.Some experience with machine provisioning, fleet deployment and maintenance, planning and maintenance of network infrastructures, audio/visual equipment is highly desirable.A keen eye for polish, QA and optimization.Experience working with web APIs desired.Experience with version control systems such as Git is highly desirable.Tertiary qualifications and / or equivalent experience is essential, with knowledge of game design and computer science principles required.Experience in writing clear and concise documentation is highly desirable. The successful applicant will be expected to produce well-commented code with clear testing instructions.A successful applicant will be able to make meaningful contributions to their team and to take responsibility for providing guidance and training to other developers as necessary. The ideal applicant will be a results-oriented team player adept at working as part of a team as well as on their own.A comprehensive portfolio of your work is required, which should clearly demonstrate your skill level and experience. It is understood that there may be IP limitations to this request. Final software builds should be sent through along with examples of strong coding standards relevant to those projects made available for review.A clear understanding of project organization, team structures, and the benefits of clean, well structured code must be demonstrated. What we offer;Get paid in AUD.Remote working.Excellent work-life balance.Collaborative Work Environment.\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQGWDvZfZ2xt7Q/company-logo_100_100/0/1630478852378?e=2147483647&v=beta&t=Etj9aRq4ip2jHyvJNY6n9PVZy7uwhSbFk7VEm0pIm_w"}, {"id": 8, "Job": "Web Developer (CMS Based)", "Job_link": "https://lk.linkedin.com/jobs/view/web-developer-cms-based-at-strattmont-3803218745?position=9&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=9W06Q2yhr86Uez5mKEdv%2Fg%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Strattmont", "Company_link": "https://mk.linkedin.com/company/strattmont?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "We are seeking a skilled Web Developer to join our team. As a Web Developer, you will be responsible for designing, developing, and maintaining our clients’ websites. You will be working with various content management systems like WordPress, Shopify, and Webflow, as well as using your expertise in PHP to develop custom solutions.In This Role, You Will Be Responsible ForWork with clients to understand their website requirements and provide solutions that meet their needsDesign and develop websites using PHP, WordPress, Shopify, and WebflowCreate custom themes and plugins for WordPressDevelop custom e-commerce solutions using ShopifyCollaborate with designers, project managers, and other developers to ensure projects are completed on time and within budgetTest and troubleshoot websites to ensure optimal performance and user experienceStay up-to-date with the latest web development technologies and trendsProvide ongoing support and maintenance for existing websitesTo Be Successful In This Role, You Should HaveProven experience in web development using PHP, WordPress, Shopify, and WebflowFamiliarity with front-end technologies such as HTML, CSS, JavaScript, and jQueryUnderstanding of website optimization techniques and best practicesStrong problem-solving skills and ability to work independently or in a team environmentExcellent communication skills and ability to work collaboratively with clients and team membersStrong attention to detail and ability to manage multiple projects simultaneouslyWe offer a dynamic and fast-paced work environment, with opportunities for growth and advancement within the company. If you are a talented Web Developer with a passion for creating high-quality websites, we encourage you to apply for this exciting opportunity.\n      \n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQGIwxbYU7l8RA/company-logo_100_100/0/1635354912863/strattmont_logo?e=2147483647&v=beta&t=q29t31-uwYX01oFPuTQvAEdNlEV31a5JRLGjGzGG76w"}, {"id": 9, "Job": "Front End Developer", "Job_link": "https://lk.linkedin.com/jobs/view/front-end-developer-at-digital-pro-business-services-p-ltd-3782078476?position=10&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=XZ4oGJTxIYQta4ywIZ01TA%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Digital Pro Business Services (P) Ltd", "Company_link": "https://in.linkedin.com/company/prodigit-in?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "ProDigit is one of the pioneers in providing end-to-end web designing and digital marketing solutions for businesses worldwide being the best digital marketing agency in Hyderabad. Over the years, we have transformed businesses by combining our strong technical ability with a deep understanding of the digital landscape. ProDigit, the best digital marketing agency in Hyderabad has also evolved; mastering new skills, developing new products and continuing to provide cutting-edge web design and digital marketing solutions to our clients.We are a coterie of conversant web developers dedicated to design websites focusing on client's customization to achieve their desired business accomplishments. We provide web designing services in Hyderabad that are ideal, powerful, technologically progressive, and easy to use. ProDigit, the house of the best web designing services in Hyderabadtakes time to learn about your business, your customers, and specific needs so that your website is not only beautiful but also help to grow your business in a meaningful way. As a result, you'll get a robust, scalable website that can be easily extended with new features and functionalities as your business grows.Through our best digital marketing agency in Hyderabad, we assist you to establish your online presence and market your business bringing in qualified customers increasing your revenue. With expertise across a range of services including search engine optimization (SEO), search engine marketing (SEM), social media marketing (SMM), Google Ads, pay-per-click (PPC) campaigns and much more, we can help create a maximum internet presence for your business. ProDigit, the best digital marketing agency in Hyderabad understands your goals and then sets up a funnel to attract convertible customers.The RoleYour Responsibilities Will IncludeDesign and Development: Develop user interfaces for web and mobile applications with a focus on responsive and adaptive design. Translate design wireframes into interactive features that enhance user experience.JavaScript and TypeScript Programming: Utilize JavaScript and TypeScript for front-end logic and data manipulation, ensuring clean, efficient, and maintainable code.HTML5 and CSS3 Utilization: Apply advanced HTML5 and CSS3 techniques to structure content and style layouts, prioritizing cross-browser compatibility and accessibility.Tailwind CSS Expertise: Employ Tailwind CSS for styling, leveraging its utility-first approach to build responsive, mobile-first front-end designs.User Experience and Interface Design: Collaborate with UX/UI designers to ensure technical feasibility and fidelity of UI/UX designs. Optimize user interfaces for maximum speed and scalability.Code Reusability and Libraries: Create and maintain reusable code libraries for future use. Develop and document UI components and patterns for use across multiple projects.Agile Development Participation: Actively engage in Agile development processes, including sprint planning, daily stand-ups, and retrospectives. Adapt to evolving project requirements and timelines.Testing and Quality Assurance: Conduct thorough testing of all front-end components. Identify and resolve issues to ensure high-quality user experiences.Professional Development and Innovation: Stay abreast of the latest trends and advancements in front-end development. Regularly seek opportunities for learning and applying new technologies and best practices.Ideal ProfileSkills RequiredBachelor's degree or equivalent in Computer Science.Minimum of 2 years' experience in frontend development.Proficiency in JavaScript, HTML5, CSS3, and Tailwind CSS.Experience in Laravel projects with Vue.js.Familiarity with Scrum/Agile development methodologies.What's on Offer?Work within a company with a solid track record of successAttractive salary & benefitsLeadership Role\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4E0BAQENdCju9bXxCg/company-logo_100_100/0/1630592920805?e=2147483647&v=beta&t=vNY0HYEVHphWux_n2FOW00So_WOmIoD0JpMx26JMiFU"}, {"id": 10, "Job": "Software Engineer (.NET)", "Job_link": "https://lk.linkedin.com/jobs/view/software-engineer-net-at-ineight-3734908076?position=11&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=Yav8QvCy6LG6yMQE19xbHA%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "InEight", "Company_link": "https://www.linkedin.com/company/ineight?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Company DescriptionInEight provides field-tested project management software for the owners, contractors, engineers and architects who are building the world around us. Over 300,000 users and more than 750 customers worldwide rely on InEight for real-time insights that help manage risk and keep projects on schedule and under budget across the entire life cycle. From pre-planning to design, from estimating to scheduling, and from field execution to turnover, InEight has powered more than $400 billion in projects globally across infrastructure, public sector, energy and power, oil, gas and chemical, mining, and commercial.Based in Scottsdale, Arizona, InEight supports a remote work model with employees working throughout the United States, Canada, Australia, Sri Lanka and Europe. InEight, an ISO 9001:2015-registered company, is a subsidiary of Kiewit Corporation (Kiewit). Kiewit, through its subsidiaries, is one of North America’s largest and most respected construction and engineering organizations.InEight is a fast-paced, innovative company comprised of high-energy teams of self-starters playing integral roles in shaping the future of capital projects around the world. Our industry-leading solutions, dedicated employees, and proven leadership team provide a solid foundation to support our continued growth and success.ResponsibilitiesIf you're looking to build your career at a fast-paced, innovative company with loads of opportunity, then look no further than InEight. Come work in a fun, collaborative environment with our friendly team of self-starters. We pride ourselves on our company culture, and every bit of InEight is designed to bring out the best in our people.We are on the lookout for talented and motivated individuals who would like to join our highly talented Software Development team. The Software Engineer will contribute knowledge of modern software development techniques and technology to design and develop best in class enterprise software solutions within a collaborative, Agile development environment. This role will have direct interaction with business analysts, product owners, product managers, UX/UI, and QA to design and develop solutions.Skills & Experience1+ years of experience in Web and/or Windows based software developmentBachelor's degree in Computer Science, IT or equivalentExperience using .NET technologies (C#.NET, MVC5, Web API), Microsoft SQL Server, REST API/API Development, Entity Framework and LINQ, JavaScript based development frameworks (Angular/React.js), Bootstrap, HTML5, CSSAbility to code software according to published standards and design guidelinesProactive, goal oriented with excellent attention to detailEffectively manages changes to work tasks and the work environment and assists others with adapting to changeDemonstrates initiative and a willingness to learn and continuously improve on performanceExperience in using Telerik components (Kendo UI) and developing Azure Web Apps or AWS experience will be beneficialExperience in working in Agile development environmentInEight Inc. is an Equal Opportunity Employer, (EOE) and will consider all applications without regard to race, marital status, sex, age, color, religion, national origin, veteran status, disability or any other characteristic protected by law.\n      \n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C560BAQHpqzUMGz-D4A/company-logo_100_100/0/1630636405176/ineight_logo?e=2147483647&v=beta&t=SRWat41KeMRlyV3bUGejdtU9DmVG3mCLdLYHU4_2CJI"}, {"id": 11, "Job": "Laravel Developer", "Job_link": "https://lk.linkedin.com/jobs/view/laravel-developer-at-digital-pro-business-services-p-ltd-3782075744?position=12&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=H1Da12mWakXQoxHmmgJSsg%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Digital Pro Business Services (P) Ltd", "Company_link": "https://in.linkedin.com/company/prodigit-in?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "ProDigit is one of the pioneers in providing end-to-end web designing and digital marketing solutions for businesses worldwide being the best digital marketing agency in Hyderabad. Over the years, we have transformed businesses by combining our strong technical ability with a deep understanding of the digital landscape. ProDigit, the best digital marketing agency in Hyderabad has also evolved; mastering new skills, developing new products and continuing to provide cutting-edge web design and digital marketing solutions to our clients.We are a coterie of conversant web developers dedicated to design websites focusing on client's customization to achieve their desired business accomplishments. We provide web designing services in Hyderabad that are ideal, powerful, technologically progressive, and easy to use. ProDigit, the house of the best web designing services in Hyderabadtakes time to learn about your business, your customers, and specific needs so that your website is not only beautiful but also help to grow your business in a meaningful way. As a result, you'll get a robust, scalable website that can be easily extended with new features and functionalities as your business grows.Through our best digital marketing agency in Hyderabad, we assist you to establish your online presence and market your business bringing in qualified customers increasing your revenue. With expertise across a range of services including search engine optimization (SEO), search engine marketing (SEM), social media marketing (SMM), Google Ads, pay-per-click (PPC) campaigns and much more, we can help create a maximum internet presence for your business. ProDigit, the best digital marketing agency in Hyderabad understands your goals and then sets up a funnel to attract convertible customers.The RoleYour Responsibilities Will IncludeDevelopment & Maintenance: Develop, maintain, and enhance web applications using the Laravel framework.Feature Implementation: Collaborate with the team to design, develop, and implement new features and functionalities.Code Quality: Write clean, efficient, and maintainable code. Conduct thorough code reviews and maintain high coding standards.Problem-Solving: Troubleshoot, debug, and upgrade existing systems. Identify and resolve performance and scalability issues.Collaboration: Work with front-end developers to integrate user-facing elements. Maintain effective communication with team members and stakeholders.API Integration: Implement and maintain third-party integrations and APIs.Project Involvement: Participate actively in project planning, estimation, and prioritization.Professional Development: Stay abreast of new trends and best practices in web development and Laravel.Principles: TDD (Test driven development) is must. (DDD) is optional.Ideal ProfileSkills RequiredYou possess a Degree/Diploma in Computer Science, Engineering or related field.You have at least 2 year experience, ideally within a Software Engineer role.You possess strong knowledge of PHP and Laravel framework.Strong experience with MySQL or other relational databases.Good understanding of HTML, CSS, and JavaScript.Experience with front-end frameworks like Vue.js or React is desirable.Familiarity with RESTful API development.Proficiency in version control tools, preferably Git.You are a strong team player who can manage multiple stakeholders.You are highly goal driven and work well in fast paced environments.You pay strong attention to detail and deliver work that is of a high standard.What's on Offer?Work within a company with a solid track record of successAttractive salary & benefitsLeadership Role\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4E0BAQENdCju9bXxCg/company-logo_100_100/0/1630592920805?e=2147483647&v=beta&t=vNY0HYEVHphWux_n2FOW00So_WOmIoD0JpMx26JMiFU"}, {"id": 12, "Job": "Software Engineer .Net", "Job_link": "https://lk.linkedin.com/jobs/view/software-engineer-net-at-osos-3794224931?position=13&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=TZ4EemzyMjcTq1AJgHRlxw%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "OSOS", "Company_link": "https://om.linkedin.com/company/osos-technology?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Position Overview: We are seeking a skilled and enthusiastic .NET Engineer to join our software development team. As a .NET Engineer, you will play a pivotal role in designing, developing, and maintaining our software applications using the latest .NET technologies, tools, and frameworks. You will collaborate with cross-functional teams to deliver high-quality, scalable, and innovative solutions. The ideal candidate should be well-versed in .NET Core development, eager to learn new technologies, and dedicated to writing efficient and maintainable code.RESPONSIBILITIES:Collaborate with product managers, designers, and other developers to understand business requirements and translate them into functional software solutions.Develop well-structured, efficient, and maintainable code using C# and the latest .NET technologies.Utilize modern frontend frameworks (e.g., React, Angular, Vue.js) to build responsive user interfaces that interact seamlessly with backend services.Design, develop, and maintain APIs and microservices using RESTful principles and best practices.Integrate third-party libraries, APIs, and services to enhance application functionality.Participate in code reviews, provide constructive feedback, and ensure adherence to coding standards.Write unit tests, and integration tests, and perform debugging to ensure the quality and reliability of the software.Collaborate with DevOps teams to ensure proper deployment, monitoring, and scaling of applications.Stay up-to-date with the latest trends, tools, and technologies in the .NET ecosystem and propose their adoption when relevant.Contribute to the continuous improvement of development processes, tools, and practices.REQUIREMENTS:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience).Proven experience as a .NET Developer or in a similar role, with a strong foundation in C# programming.Familiarity with .NET Core/.NET 6 framework and its features.Experience with frontend technology Angular.Proficiency in building RESTful APIs and microservices architecture.Solid understanding of version control systems (Git) and collaboration tools (GitHub, GitLab).knowledge of database concepts and SQL.Strong problem-solving skills and attention to detail.Effective communication skills and the ability to work within a team.Familiarity with Agile/Scrum methodologies and project management tools.Preferred Additional Skills:Experience with cloud platforms like Azure, AWS, or Google Cloud.Knowledge of containerization using Docker and container orchestration with Kubernetes.Exposure to continuous integration and continuous deployment (CI/CD) pipelines.Understanding of software design patterns and architectural principles.Knowledge of NoSQL databases or other data storage solutions.Experience with GraphQL for efficient data querying.Involvement in open-source projects or personal coding projects.\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQHR6CrFNzUGnA/company-logo_100_100-alternative/0/1630580418203/osostech_logo?e=2147483647&v=beta&t=2LVuyQZWQf20k-szYCdsueB9YdZpsKHXK4RuU2-RWf4"}, {"id": 13, "Job": "Senior Frontend Developer", "Job_link": "https://lk.linkedin.com/jobs/view/senior-frontend-developer-at-patona-3808174282?position=14&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=Vd1rWdNEIe46LFD9Z0jllQ%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Patona", "Company_link": "https://au.linkedin.com/company/patona?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "DescriptionPatona works with top enterprises and digital native businesses in Australia helping them build their remote teams in Philippines, India and Sri Lanka. Working with well known market leading brands we pride ourselves with hiring great teams to work on exciting game changing technology. Patona currently has 160+ engineers, testers, product managers etc working across 20+ partners. We focus on uplifting the way organisations build and manage their remote teams through great working relationships, trust, integrity, culture and hiring processes. Additional to this we are building our own technology product offerings. Patona is Japanese for Partner (although we are not from Japan) we believe in partnerships with our clients and our people where everyone wins. This is the only way true partnerships thrive.We are a rapidly growing, innovative and enthusiastic organisation, we believe in surrounding ourselves with great people. We strive to deliver the best outcomes for our customers, our partners and our people. We have multiple roles open working as part of a remote team for our partners in Australia. If this role does not quite match please reach out if you are interested in joining us as we currently have over 50 open opportunities.RequirementsDevelop and maintain scalable and robust frontend applications using React.js. Experience in building responsive UI and Redux for state management. Participate in all phases of the development lifecycle, including ideation, design, development, testing, and deployment. Collaborate with backend developers and UI/UX designers to improve usability. Gather and address technical and design requirements. Stay abreast of emerging technologies and industry trends, applying them to operations and activities. Essential Skills and Qualifications:Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field. Proven experience as a Frontend Developer minimum 6+ years, specifically with React.js.BenefitsFlexibility in work hours and location, with a focus on managing energy rather than time.Private Health insurance\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/D560BAQFocclUg9Pc2A/company-logo_100_100/0/1666760677189/patona_logo?e=2147483647&v=beta&t=bfiE8Xw0pkiQorwm8epMvt3wMj6LN8axuy9_8BKGiFU"}, {"id": 14, "Job": "Senior Software Engineer - Java", "Job_link": "https://lk.linkedin.com/jobs/view/senior-software-engineer-java-at-mad-mobile-3787770939?position=15&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=9EmywDDQdUuFqcaZr4MhOA%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Mad Mobile", "Company_link": "https://www.linkedin.com/company/mad-mobile?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Mad Mobile is leading the charge in building the next generation of retail and restaurant experiences. In today's rapidly evolving market, customer expectations continue to change, and Mad Mobile is at the forefront of innovation. We empower customers to engage and purchase from brands seamlessly, whether they're in-store, outside the four walls, or on the go. Our platform already supports some of the biggest brands, and we're always looking for new ways to engage with Customers, increase in-store productivity and ultimately drive transactional value. If you're passionate about creating exceptional experiences and shaping the future of retail and restaurants, Mad Mobile is the place for you!Role will be located in Colombo, SLIn this role you will:Design and develop groundbreaking products that change the restaurant and retail space.Implement distributed and highly available applications that will scale up for enterprise demands.Adhere to Continuous Integration and Continuous Delivery of solutions.Ensure high code quality by following software engineering best practices.Work collaboratively in a cross functional team in an Agile delivery environment.Adhere to DevOps principles and be involved with projects throughout their full software lifecycle: from development, QA, and deployment to post-production support.We are looking for someone who has:Strong knowledge of OOP and modern software design patternsExcellent understanding of Java Enterprise patterns, integration patterns and enterprise engineering best practices.Proficiency in programming in Java in Spring Boot & Hibernate.Experience in writing test driven code for back-end services.Experience in relational/non-relational database management systemsQuick learner with a strong drive for self-improvement.Knowledge of working with version control systems like Git/Bitbucket.Familiarity with working in a Scrum Agile delivery environment.Excellent communication skills and the ability to work effectively as part of distributed global teams.You may be a good fit if you have these additional skills and/or educational background:Experience in Front-end technologies like React JS would be an added advantageFamiliarity with microservices, serverless architecture, AWS, Docker, Kubernetes (k8s), and Kafka is advantageous.Familiarity with DevOps practices and prior experience working with Cloud IaaS or PaaS providers.Our core values:Customer – WE believe that our customers deserve the best from us every day.Accountability – WE take ownership and make things happen.Teamwork – WE win as a team and have fun doing it.Innovation – WE innovate, inspire, ignite the future!Integrity – WE are honest, ethical, and trustworthy.Why Mad Mobile?Mad Mobile is the #38 fastest-growing company in Florida and #9 on the Tampa Bay Times Top 100 Workplace List. We’re proud of our culture and promote diversity and a healthy work-life balance.What about the benefits you ask?Enjoy the advantage of salaries pegged to the US dollar, addressing your concerns regarding the varying cost of living.We pay for performance, going beyond market rates for deserving individuals.Our benefits package includes OPD and Hospitalization cover to you and your family, providing you with peace of mind and access to quality healthcare when you need it the most.Embrace work-life balance with our flexible hybrid working patterns.Amazing value beyond your day job,Join our active engagement clubs to enjoy a variety of engaging events and activities designed to foster team spirit, creating lasting memories.As we are not offshore, you will be part of a global organization that maintains a multicultural, diversified, and open culture with opportunities to work on-site in our US headquarters.You will have access to continuous learning, training programs, skill workshops, and resources to upskill your talent.You will have the opportunity to fast-track your career, as we open new and exciting opportunities within the organization.Powered by JazzHRclZs3CjWpA\n      \n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/D4E0BAQGGhPGrdrGzkw/company-logo_100_100/0/1698850755046/mad_mobile_logo?e=2147483647&v=beta&t=gdMmGH9p0vZ1L52VbOmNPth9jqUaV-_aHLYskQkAmms"}, {"id": 15, "Job": "Front End Development", "Job_link": "https://lk.linkedin.com/jobs/view/front-end-development-at-salesqueen-software-solutions-3792871882?position=16&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=Tt99Mi7ka4DkJRxZVrFd7A%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "Salesqueen Software Solutions", "Company_link": "https://in.linkedin.com/company/salesqueen-software-solutions?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "Salesqueen is a well-known Digital Agency based in India. With modern developed technology, we are dedicated to making your digital identity unique.The RoleYou Will Be Responsible ForWriting well-designed, testable and efficient code.Gathering and evaluating user feedback.Working as a part of a dynamic team to deliver winning products.Providing code documentation and other inputs to technical documents.Supporting continuous improvement by investigating alternatives and new technologies and presenting these for architectural review.Troubleshooting and debugging to optimize performance.Ideal ProfileYou possess a Degree/Diploma in Computer Science, Engineering or any other Fresher to any years of experience.You are a strong team player who can manage front end design.Must have knowledge in html, css , javascript and bootstrap.You are highly goal driven and work well in fast paced environmentsWhat's on Offer?Great work environmentAttractive salary & benefitsExcellent career development opportunities\n\n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C560BAQEgRZwF9uG6sg/company-logo_100_100/0/1652077591450/salesqueen_software_solutions_logo?e=2147483647&v=beta&t=icgCJVF2-Kq6vNZIbXp1sDM89hOLhnX0PvJ6h918gyg"}, {"id": 16, "Job": "Software Architects", "Job_link": "https://lk.linkedin.com/jobs/view/software-architects-at-codegen-international-3799598648?position=17&pageNum=0&refId=SGqpiZMcOrA0SocqNvvoKA%3D%3D&trackingId=sNjxz%2FOtk%2BjM3f9w8Vwu9w%3D%3D&trk=public_jobs_jserp-result_search-card", "Company": "CodeGen International", "Company_link": "https://uk.linkedin.com/company/codegen?trk=public_jobs_jserp-result_job-search-card-subtitle", "Job_detail": "ResponsibilitiesImplementation and design of highly scalable applications using Java, Spring REST, Angular and microservices architecture. in line with the industry’s current needs + future trendsTake the ownership of enterprise grade application development and testing and deliveryPresent and defend the TravelBox architecture and technology stack when pitching to external stakeholdersLeading the implementation & delivery of product developments (Angular/Java/APIs/Caching/Database)Ensure development best practices are followed by the team while conforming to non functional requirements of the systemsResponsible for delivering software with highest quality upto production environmentCustomer engagement on requirement discussions and providing solution directionsAdhere to agile development principles while following and improving all aspects of the scrum processAssist performance appraisals and provide guidance and mentoring the team membersHelping on interviews and hiring process of new team membersWe believe in architects are capable of coding and testing in addition to software architectingPre - RequisitesBSc in Computer Science/Engineering or equivalent qualification8+ years industry experience with demonstrable experience in innovation, leading teams, and designing products/solutions of comparable scale and complexityStrong technical skills and hands-on experience in Java, Angular ,Oracle, DevOps, CI/CD and cloud deploymentsProven track record of providing enterprise grade solutions for business & technical requirementsA growth mindset with desire to learn and explore new technologiesExcellent interpersonal, communication and leadership skills\n      \n\n        Show more\n\n        \n\n\n        Show less", "Image": "https://media.licdn.com/dms/image/C4D0BAQF-OLXZfd4jcA/company-logo_100_100/0/1630546328600/codegen_logo?e=2147483647&v=beta&t=Z_wQkvVt5GPUctgUFi64qtz0jHMhhqqpMsByVPw037M"}]